Repository: strictly4U/Zone-de-livrare-pentru-Fan-Courier-Romania
Catalog: languages/hge-zone-*-livrare-pentru-fan-courier-romania-*.po
Languages: ro_ro

source: HgE: Shipping Zones for FAN Courier Romania
ro_ro: HgE: Zone de Livrare pentru FAN Courier Romania

source: WooCommerce shipping zones integration for FAN Courier Romania (Standard service). Manual AWB generation, PDF label display for orders, and AWB generation history.
ro_ro: Integrare zone de livrare WooCommerce pentru FAN Courier Romania (serviciu Standard). Generare manuală AWB, afișare etichete PDF pentru comenzi și istoric generare AWB.

source: requires WooCommerce to work. Please install and activate WooCommerce.
ro_ro: necesită WooCommerce pentru a funcționa. Te rugăm să instalezi și să activezi WooCommerce.

source: Fan Courier – Healthcheck
ro_ro: Fan Courier – Verificare Sănătate

source: Generate AWB
ro_ro: Generează AWB

source: Download PDF
ro_ro: Descarcă PDF

source: Verify AWB
ro_ro: Verifică AWB

source: Sync AWB
ro_ro: Sincronizare AWB

source: AWB generated successfully
ro_ro: AWB generat cu succes

source: Error generating AWB
ro_ro: Eroare la generarea AWB

source: Generating AWB...
ro_ro: Se generează AWB...

source: Checking AWB in FanCourier...
ro_ro: Verificare AWB în FanCourier...

source: AWB synced successfully
ro_ro: AWB sincronizat cu succes

source: Error syncing AWB
ro_ro: Eroare la sincronizarea AWB

source: FAN Courier Settings
ro_ro: Setări FAN Courier

source: API Credentials
ro_ro: Credențiale API

source: Username
ro_ro: Nume utilizator

source: Password
ro_ro: Parolă

source: Client ID
ro_ro: ID Client

source: API Key
ro_ro: Cheie API

source: Debug Log
ro_ro: Jurnal Debug

source: Enable debug logging
ro_ro: Activează înregistrarea debug

source: Automatic AWB Generation
ro_ro: Generare Automată AWB

source: Enable automatic AWB generation
ro_ro: Activează generarea automată de AWB

source: Order Status
ro_ro: Status Comandă

source: Processing
ro_ro: În procesare

source: Completed
ro_ro: Finalizată

source: On Hold
ro_ro: În așteptare

source: Standard shipping via FAN Courier
ro_ro: Livrare standard prin FAN Courier

source: Shipping Cost
ro_ro: Cost transport

source: Enable/Disable
ro_ro: Activează/Dezactivează

source: Enable this shipping method
ro_ro: Activează această metodă de livrare

source: Method Title
ro_ro: Titlu metodă

source: This controls the title which the user sees during checkout.
ro_ro: Acest text controlează titlul pe care utilizatorul îl vede la checkout.

source: Invalid order ID
ro_ro: ID comandă invalid

source: Order not found
ro_ro: Comandă negăsită

source: Insufficient permissions
ro_ro: Permisiuni insuficiente

source: Invalid nonce
ro_ro: Nonce invalid

source: Missing nonce
ro_ro: Nonce lipsă

source: AWB already exists
ro_ro: AWB deja existent

source: AWB not generated yet
ro_ro: AWB nu a fost generat încă

source: Order status not allowed for AWB generation
ro_ro: Status-ul comenzii nu permite generarea AWB

source: API credentials not configured
ro_ro: Credențialele API nu sunt configurate

source: Could not connect to FAN Courier API
ro_ro: Nu s-a putut conecta la API-ul FAN Courier

source: Test API credentials
ro_ro: Testează credențiale API

source: Force AWB synchronization
ro_ro: Forțează sincronizarea AWB

source: Check deleted AWBs
ro_ro: Verifică AWB-uri șterse

source: Clear expired locks
ro_ro: Curăță lock-uri expirate

source: Ping failed
ro_ro: Ping eșuat

source: Credentials appear valid (API response OK).
ro_ro: Credențialele par valide (răspuns API OK).

source: Invalid credentials
ro_ro: Credențiale invalide

source: Order status:
ro_ro: Status comandă:

source: Generated:
ro_ro: Generat:

source: Last updated:
ro_ro: Ultima actualizare:

source: No history available for this order.
ro_ro: Nu există istoric pentru această comandă.

source: Recent errors detected
ro_ro: Erori recente detectate

source: Action
ro_ro: Acțiune

source: Date
ro_ro: Dată

source: Details
ro_ro: Detalii

source: AWB generation is available for the following statuses:
ro_ro: Generarea AWB este disponibilă pentru următoarele status-uri:

source: New Order
ro_ro: Comandă Nouă

source: Payment Confirmed
ro_ro: Plată Confirmată

source: Generate Invoice Advance
ro_ro: Emite Factură Avans

source: AWB generation is not available for this status.
ro_ro: Generarea AWB nu este disponibilă pentru acest status.

source: Allowed statuses:
ro_ro: Status-uri permise:
